In [1]:
import pandas as pd

df = pd.DataFrame({'칸1' : [1, 2, 3], '칸2' : [100, 200, 300]})

In [2]:
df

   칸1   칸2
0   1  100
1   2  200
2   3  300

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df = pd.DataFrame(
    {
        "나이" : [15, 17],
        "성별" : ["남", "여"],
        "학교" : ["수리중", "덕영중"]
    },
    index = ['준서', '예은']
)
df

    나이 성별   학교
준서  15  남  수리중
예은  17  여  덕영중

In [5]:
df = pd.DataFrame([
                   [15, "남", "수리중"],
                   [17, "여", "덕영중"]
                    ],
                  index = ['준서', '예은'],
                  columns = ['나이', '성별', '학교']
)
df

    나이 성별   학교
준서  15  남  수리중
예은  17  여  덕영중

In [6]:
df.index, df.columns

(Index(['준서', '예은'], dtype='object'),
 Index(['나이', '성별', '학교'], dtype='object'))

In [7]:
df1 = df.copy()

In [8]:
df1.index = ['학생1', '학생2']

In [9]:
df1.columns = ['연령', '남녀', '소속']

In [10]:
df1

     연령 남녀   소속
학생1  15  남  수리중
학생2  17  여  덕영중

In [11]:
df2 = df.copy()

In [12]:
df2.rename(index = {'학생1' : '준서'},
          columns = {'나이' : '연령'},
          inplace = True)

In [13]:
df2

    연령 성별   학교
준서  15  남  수리중
예은  17  여  덕영중

In [14]:
df = pd.DataFrame(
    {
        "수학" : [90, 80, 70],
        "영어" : [98, 89, 95],
        "음악" : [85, 95, 100],
        "체육" : [100, 90, 80]
    }
)
df

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   80

In [15]:
df1 = df.copy()

In [16]:
df1.index = ['서준', '우현', '인아']

In [17]:
df1

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   80

In [18]:
df1['수학']

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [19]:
df1[["수학", "영어", "음악"]]

    수학  영어   음악
서준  90  98   85
우현  80  89   95
인아  70  95  100

In [20]:
df1.loc['우현']

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [21]:
df1.drop("우현", axis = 0, inplace = True)

In [22]:
df1

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   80

In [23]:
df2 = df.copy()
df2.index = ['서준', '우현', '인아']

In [24]:
df2.loc['서준']

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [25]:
df2.음악

서준     85
우현     95
인아    100
Name: 음악, dtype: int64

In [26]:
df2[["음악", "체육"]]

     음악   체육
서준   85  100
우현   95   90
인아  100   80

In [27]:
df2.loc["서준", "음악"]

85

In [28]:
df2.iloc[1:2,:-1]

    수학  영어  음악
우현  80  89  95

In [29]:
df2["국어"] = 80

In [30]:
df2['과학'] = [100, 90, 80]

In [31]:
df2

    수학  영어   음악   체육  국어   과학
서준  90  98   85  100  80  100
우현  80  89   95   90  80   90
인아  70  95  100   80  80   80

In [32]:
df3 = df.copy()

In [33]:
df3.index = ['서준', '우현', '인아']

In [34]:
df3.loc['동규'] = [100, 90, 80, 70]

In [35]:
df4 = df.copy()

In [36]:
df4

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   80

In [37]:
df4['이름'] = ['서준', '우현', '인아']

In [38]:
df4.set_index('이름', inplace = True)

In [39]:
df4

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   80

In [40]:
df4.transpose()

이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   80

In [41]:
df4

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   80

In [42]:
df4.reset_index(inplace = True)

In [43]:
df4

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   80

In [44]:
df = pd.DataFrame({
    '학과' : ['컴공', '보안', '컴공', '보안'],
    '학년' : [1, 4, 2, 3],
    '이름' : ['홍길동', '홍길순', '이몽룡', '성춘향'],
    '학점' : [4.0, 4.5, 3.9, 4.4]
})

In [45]:
df

   학과  학년   이름   학점
0  컴공   1  홍길동  4.0
1  보안   4  홍길순  4.5
2  컴공   2  이몽룡  3.9
3  보안   3  성춘향  4.4

In [46]:
df1 = df.copy()

In [47]:
df1.set_index('이름', inplace = True)

In [48]:
df1

     학과  학년   학점
이름
홍길동  컴공   1  4.0
홍길순  보안   4  4.5
이몽룡  컴공   2  3.9
성춘향  보안   3  4.4

In [49]:
df1.loc['이몽룡', '학점']

3.9

In [50]:
df2 = df.copy()

In [51]:
df2.set_index(['학과', '학년'], inplace = True)

In [52]:
df2.loc[('컴공', 2)]

이름    이몽룡
학점    3.9
Name: (컴공, 2), dtype: object

In [53]:
df2.xs('컴공', level = '학과')

     이름   학점
학년
1   홍길동  4.0
2   이몽룡  3.9

In [54]:
df2.xs(2, level = '학년')

     이름   학점
학과
컴공  이몽룡  3.9

In [55]:
df2.sort_index(inplace=True)

In [56]:
df2

        이름   학점
학과 학년
보안 3   성춘향  4.4
   4   홍길순  4.5
컴공 1   홍길동  4.0
   2   이몽룡  3.9

In [57]:
import seaborn as sns

In [58]:
sns.load_dataset("titanic")

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [59]:
titanic = sns.load_dataset("titanic")

In [60]:
titanic

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [61]:
titanic[["age","fare"]]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [62]:
titanic.loc[ : , ["age", "fare"]]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]